package day04;

public class Step4 {
    public static void main(String[] args) {
        // 1.무한루프
        while (true){ // w s


        }
    } // m e
} // c e

/*
   은행 프로그램 구현
      [요구사항 설계]
      1. 반복적으로 기능 사용 [단* 종료 기능 선택시 종료]
      2. 기능 : 예금, 출금, 잔고, 종료
            예금 : 더하기 작업
                금액에서 예금액을 입력받아 금액에 더한다
            출금 : 빼기 작업
                금액에서 출금액을 입력받아 금액에서 빼기한다
            잔고 : 확인 작업
                금액의 값을 출력한다
            종료 : 프로그램 끝내는 작업
      3. 데이터 설계
            금액 : 예금, 출금 했을 때 누적으로 저장(전역)
      [구현 순서]
        1.
* */
